{
  "sortnum": 8,
  "name": "Craft Guide",
  "icon": "maid_storage_manager:craft_guide",
  "category": "touhou_little_maid:maid_storage_manager",
  "pages": [
    {
      "type": "spotlight",
      "item": "maid_storage_manager:craft_guide",
      "text": "The Craft Guide requires a bind work block to continue  configure. With this item in hand, sneak right-click on a supported work block to bind the recipe type. $(br2) Recipe types currently supported: $(br) Crafting Table, Furnace, Stone Cutter, Smithing Table, Anvil, Brewing Stand and Touhou Little Maid's Multi-Block Altar (sneak-right-click anywhere on the altar to bind) and TACZ workbench."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide.png"
      ],
      "title": "Binding to Crafting Table.",
      "text": "For more custom configuration details, see $(l:maid_storage_manager/9_craft_guide_settings) Advanced Crafting $(/l)"
    },
    {
      "type": "text",
      "title": "Fill in the recipe",
      "text": "After binding the work block, you can then open the GUI and fill the recipe manually or select a recipe from the jei. Once the recipe is filled, the Craft Guide will render the appropriate products and work blocks. $(br2)Tips: the experience required for anvil recipes and the P-points required for altar recipes will be deducted from the experience on the maid accordingly, and if the maid does not have enough experience, the crafting will fail."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide2.png"
      ],
      "title": "A Crafting-Table recipe",
      "text": ""
    },
    {
      "type": "text",
      "title": "Parallel Crafting",
      "text": "If multiple craft guides are written for the same item but bound to different work position(such as smelting ore bound to different furnaces), the maid will automatically select another crafting guide and use another workbench when she finds that one of the workbenches is occupied by another maid."
    },
    {
      "type": "altar_recipe",
      "recipe_id": "maid_storage_manager:craft_guide"
    }
  ]
}