{
  "sortnum": 8,
  "name": "Craft Guide",
  "icon": "maid_storage_manager:craft_guide",
  "category": "touhou_little_maid:maid_storage_manager",
  "pages": [
    {
      "type": "spotlight",
      "item": "maid_storage_manager:craft_guide",
      "text": "The Craft Guide requires a bind work block to continue  configure. With this item in hand, sneak right-click on a supported work block to bind the recipe type. $(br2) Recipe types currently supported: $(br) Crafting Table, Furnace, Stone Cutter, Smithing Table, Anvil, Brewing Stand and Touhou Little Maid's Multi-Block Altar (sneak-right-click anywhere on the altar to bind) and TACZ workbench."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide.png"
      ],
      "title": "Binding to Crafting Table.",
      "text": ""
    },
    {
      "type": "text",
      "title": "Fill in the recipe",
      "text": "After binding the work block, you can then open the GUI and fill the recipe manually or select a recipe from the jei. Once the recipe is filled, the Craft Guide will render the appropriate products and work blocks. (Anvil recipes are not available at the moment due to the fact that recognising NBT tags in crafting is not yet possible) $(br2)Tips: the experience required for anvil recipes and the P-points required for altar recipes will be deducted from the experience on the maid accordingly, and if the maid does not have enough experience, the crafting will fail."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide2.png"
      ],
      "title": "A Crafting-Table recipe",
      "text": ""
    },
    {
      "type": "text",
      "title": "Advanced Crafting",
      "text": "If the binding block is not a working block, or if you click again on a binded working block, the Craft Guide will switch to a more advanced custom configuration mode. In this mode, you can toggle between ‘Bind Block’, ‘Bind Side’ and ‘Unbind’ with the sneak right-click, sneak rolling wheel to bind a new step or select the current step."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide3.png"
      ],
      "title": "3rd step in a Craft Guide.",
      "text": ""
    },
    {
      "type": "text",
      "title": "Configure custom",
      "text": "Each line of information in the GUI represents a step in a custom recipe: $(br)The buttons on the left move the step up and down and delete it. $(br)The item grid in the middle represents the items used/acquired by that step.$(br)The right side of the item grid represents the $(l:maid_storage_manager/craft_guide#craft_mode) working mode $(/l) of the current step.$(br)Binded blocks are rendered to the right of the working mode.$(br)The button to the far right controls whether the step can be ignored and skipped."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide4.png"
      ],
      "title": "Custom crafting configure",
      "text": ""
    },
    {
      "type": "text",
      "title": "Working modes",
      "anchor": "craft_mode",
      "text": "Tapping the Work Mode button opens a small picklist. Scroll wheel or tap to change the working mode of the current step."
    },
    {
      "type": "text",
      "title": "Working Modes1",
      "text": "1. Insert: Insert items into the bound block; 2. Split: Input items into the bound block without stacking across different slots (e.g., for Cook Pot); 3. Extract: Extract target items from the bound block; 4. Throw: Throw items as entities at the bound position; 5. PickUp: Pick up target item entities from the bound position."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide6.png"
      ],
      "title": "Working Modes1"
    },
    {
      "type": "text",
      "title": "Working Modes2",
      "text": "6. Use: Right-click bound position with input item to get the output item (both can be empty, e.g., for log stripping); 7. Destroy: Destroy bound block with input item and get the output item; 8. Idle: Wait at bound position for specified time (press T/S to switch time units, scroll to adjust – e.g., to avoid processing timeouts)."
    },
    {
      "type": "image",
      "images": [
        "maid_storage_manager:textures/book/craft_guide7.png"
      ],
      "title": "Working Modes2",
      "text": "Tips: Item mark in idle mode will be considered as 'Acquired' when maid was waiting. Sometimes maybe useful to solve some recipe."
    },
    {
      "type": "text",
      "title": "Optional/Required Step",
      "text": "Sometimes a part of a recipe is unpredictable (probable output, side-products) and the maid will wait without the specified output until the recipe times out. In cases of uncertainty such as these, the step can be made ‘optional’ and the maid will perform the corresponding action and move on to the next crafting step, regardless of whether it is successful or not."
    },
    {
      "type": "altar_recipe",
      "recipe_id": "maid_storage_manager:craft_guide"
    }
  ]
}