{
  "sortnum": 5,
  "name": "Request List",
  "icon": "maid_storage_manager:request_list",
  "category": "touhou_little_maid:maid_storage_manager",
  "pages": [
    {
      "type": "spotlight",
      "item": "maid_storage_manager:request_list",
      "text": "Don't want to rummage through the warehouse yourself? Use the request list! Sneak right-click to bind the place where the item was delivered, then fill out the list, then give it to the maid. $(br) The maid will place the found items in this chest along with the request list."
    },
    {
      "type": "image",
      "images": [
          "maid_storage_manager:textures/book/request.png"
      ],
      "title": "Binded chest",
      "text": ""
    },
    {
      "type": "text",
      "title": "Configure the Request List",
      "text": "Columns one and three in the list are the requested items, and columns two and four are the completion status of the requested items.Items can be dragged in from the jei or backpack to mark them, and the wheel to adjust the number of requests.$(br2) If you want to craft an item, clicking on the plus sign for a jei recipe will automatically fill the request list with the ingredients needed for the recipe.$(br2)See $(l:maid_storage_manager/request_list_settings) ‘Request List Advanced Configuration’ $(/l) for the rest of the configuration items."
    },
    {
      "type": "image",
      "images": [
          "maid_storage_manager:textures/book/request2.png"
      ],
      "title": "Request List GUI",
      "text": ""
    },
    {
      "type": "text",
      "anchor": "finish_task",
      "title": "After finishing the task",
      "text": "Once the job is finished, you can find the requested item (if any) and the request list (whether completed or not) in the target chest, and open the list to see the progress of the job. Tip: Before using the list again, be sure to click the ‘Clear Working Status’ button in the bottom right corner."
    },
    {
      "type": "altar_recipe",
      "recipe_id": "maid_storage_manager:request_list"
    }
  ]
}