{
  "chat_bubbles.maid_storage_manager.check_mark_changed": "Master’s order! Scanning box nyaa~",
  "chat_bubbles.maid_storage_manager.chest_full": "Storage full boom! Clean now~",
  "chat_bubbles.maid_storage_manager.craft_calculated": "Crafting math ON! [%s/%s]Spinning~",
  "chat_bubbles.maid_storage_manager.crafting": "Crafting magic %s GO! Click-clack~",
  "chat_bubbles.maid_storage_manager.crafting_fail": "Oops, %s crafting failed!",
  "chat_bubbles.maid_storage_manager.crafting_gathering": "Items radar ON! Beep beep~",
  "chat_bubbles.maid_storage_manager.crafting_gathering_item": "%s*%s Item gathering...",
  "chat_bubbles.maid_storage_manager.crafting_progress": "Crafting [%s %s/%s]! Click-clack~",
  "chat_bubbles.maid_storage_manager.crafting_success": "%s completed! Maid’s magic workshop triumph~",
  "chat_bubbles.maid_storage_manager.missing": "Items hide-and-seek? Pout!",
  "chat_bubbles.maid_storage_manager.request_fail": "T^T Items missing! Tears attack!",
  "chat_bubbles.maid_storage_manager.request_finish": "Mission complete! Praise me!",
  "chat_bubbles.maid_storage_manager.request_start": "Search mode activated! Beep beep——",
  "chat_bubbles.maid_storage_manager.resort": "Wrong spot! Naughty master~",
  "chat_bubbles.maid_storage_manager.cowork_enable": "Master’s back! Bounce bounce~",
  "chat_bubbles.maid_storage_manager.cowork_disable": "Master departure detected…",
  "gui.maid_storage_manager.config.bool.disable": "Disable",
  "gui.maid_storage_manager.config.bool.enable": "Enable",
  "gui.maid_storage_manager.config.co_work": "Co-working Mode",
  "gui.maid_storage_manager.config.memory_assistant": "Memory Assistant Taking",
  "gui.maid_storage_manager.config.memory_assistant.always_scan": "Always Scan",
  "gui.maid_storage_manager.config.memory_assistant.memory_first": "Memory First",
  "gui.maid_storage_manager.config.memory_assistant.memory_only": "Memory Only",
  "gui.maid_storage_manager.config.no_sort_placement": "No Sorting When Place Item",
  "gui.maid_storage_manager.filter_list.blacklist": "Using blacklist",
  "gui.maid_storage_manager.filter_list.item": "* %s",
  "gui.maid_storage_manager.filter_list.match_tag_off": "Don't match tags",
  "gui.maid_storage_manager.filter_list.match_tag_on": "Match tags",
  "gui.maid_storage_manager.filter_list.title": "Filter",
  "gui.maid_storage_manager.filter_list.whitelist": "Using whitelist",
  "gui.maid_storage_manager.request_list.clear": "Clear working status",
  "gui.maid_storage_manager.request_list.match_tag_off": "Don't match tags",
  "gui.maid_storage_manager.request_list.match_tag_on": "Match tags",
  "gui.maid_storage_manager.request_list.never": "[Never]",
  "gui.maid_storage_manager.request_list.repeat": "Repeat",
  "gui.maid_storage_manager.request_list.repeat_desc": "[%s t]",
  "gui.maid_storage_manager.written_inventory_list.find": "Click to highlight the item",
  "gui.maid_storage_manager.written_inventory_list.inventory_list_page": "%s / %s",
  "gui.maid_storage_manager.written_inventory_list.next": ">",
  "gui.maid_storage_manager.written_inventory_list.pos": "Store at [%d,%d,%d]=> %d",
  "gui.maid_storage_manager.written_inventory_list.previous": "<",
  "gui.maid_storage_manager.written_inventory_list.request_item_info": "%s [%s/%s]",
  "gui.maid_storage_manager.written_inventory_list.search": "Search",
  "interaction.bind_storage": "Storage bind to [%s,%s,%s]",
  "interaction.clear_storage": "Storage unbind",
  "interaction.flag_changed": "%d storage changes has been provided to this maid.",
  "interaction.mode_append": "Mode: Append",
  "interaction.mode_remove": "Mode: Remove",
  "interaction.mode_replace": "Mode: Replace",
  "interaction.mode_replace_spec": "Mode: Replace Specified",
  "interaction.select_input1": "Select Input1",
  "interaction.select_input2": "Select Input2",
  "interaction.select_output": "Select Output",
  "item.maid_storage_manager.change_flag": "Change Flag",
  "item.maid_storage_manager.craft_guide": "Craft Guide",
  "item.maid_storage_manager.filter_list": "Filter List",
  "item.maid_storage_manager.inventory_list": "Inventory List",
  "item.maid_storage_manager.no_access": "No Access",
  "item.maid_storage_manager.portable_craft_calculator_bauble": "Portable Craft Calculator",
  "item.maid_storage_manager.request_list": "Request List",
  "item.maid_storage_manager.storage_define_bauble": "Storage Define",
  "item.maid_storage_manager.written_inventory_list": "Written Inventory List",
  "jei.maid_storage_manager.altar_craft.item_craft.result": "Crafting Item",
  "maid_storage_manager.changed_flag_binding_render.changed": "Changed",
  "maid_storage_manager.craft_guide_render.input1": "Input1",
  "maid_storage_manager.craft_guide_render.input2": "Input2",
  "maid_storage_manager.craft_guide_render.output": "Output",
  "maid_storage_manager.inventory_list_render.inv": "%s * %s",
  "maid_storage_manager.request_list_binding_render": "Request Binding",
  "maid_storage_manager.storage_define_bauble_binding_render.append": "Storage[Append]",
  "maid_storage_manager.storage_define_bauble_binding_render.remove": "Storage[Remove]",
  "maid_storage_manager.storage_define_bauble_binding_render.replace": "Storage[Replace]",
  "maid_storage_manager.storage_define_bauble_binding_render.replace_spec": "Storage[Replace Specific]",
  "maid_storage_manager_tab_main": "Maid Storage Manager",
  "patchouli.touhou_little_maid.book.categories.maid_storage_manager": "Maid Storage Manager",
  "patchouli.touhou_little_maid.book.categories.maid_storage_manager.description": "It's time for the maid to manage your storage.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.change_flag":"Change Flag",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.change_flag.pages.0.1.text":"According to the ‘Storages Scanning’ rule mentioned above, it may take a long time for a maid to realise that something has changed in one of her storages. If you want your maid to be aware of changes to items quickly, you can craft a Storage Update Flag. To do this, $(br2) right-click on a chest that has changed while holding the Storage Update Flag to mark the chest that has changed (or not, see later), and then right-click on the Maid while holding the item, and the Maid will instantly scan those chests.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide":"Crafting",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide.pages.0.1.text":"The maid crafting system is relatively complex; the system is designed to simplify a number of simple operations, and performing particularly complex operations exponentially increases the probability of error (see below). Before performing a craft, a maid needs to wear the bauble ‘Portable Crafting Calculator’, which will help her to calculate complex crafting paths (the maid only needs to enter the recipe and the items in her storages, the calculator has to take a lot more into account) $(br2) In order for a maid to be able to craft something, she needs to have a craft guide for the item in her memory of the storages, as well as a guide to the ingredient or ingredients needed to make it, and be able to eventually craft the item. or a craft guide for an ingredient that can ultimately be traced back to an existing item (in other words, all leaf items on the crafting tree must be present in the maid's memory).",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide.pages.0.2.1.text":"General crafting is also known as input-item-get-output crafting. The Maid will place the items from Input 1 into the Input 1-marked locations, attempt to place the Input 2 items into the Input 2-marked locations, and take the Output items from the Output-marked locations. Use sneak + wheel to toggle the location being marked. Sneak right to store for marking and sneak right again to specify the face. Input 1 and output are required, input 2 can be left unmarked. Once you have finished marking, right click to open the GUI, the top left nine squares are input 1, the bottom left nine squares are input 2, and the right grid is output. Mark items on the grid and use the mouse wheel to adjust the quantity. When crafting, the Maid will wait until Input 1 completes the input/obtains the output, but will not wait for Input 2 to complete, which can be used in places such as Furnace Fuel.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide.pages.0.2.text":"The craft guide can be compared to the craft templates of other mods, and is used to guide the Maid through the crafting process. There are two uses for the craft guide, crafting table crafting and general crafting. The $(li) workbench craft is relatively simple to use; sneak right-click on the workbench with the craft guide in hand and observe that the workbench is marked as input 1; then open the GUI and fill in the recipe in the nine-panel box in the upper left corner; the product should automatically appear on the right side and the crafting table should be marked as output. At this point the craft guide has finished being written.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide.pages.0.3.text":"Once you have finished writing the craft guide, place it somewhere in the storages (just as long as the maid can access it). When the items in the request list are not found, the maid will try to calculate possible solutions for the craft and perform the crafting. When $(br2) maid crafting proceeds, it calculates all the actions that need to be performed (such as what raw materials to obtain and what actions to perform at what location), and then performs the craft according to the calculations. These are calculated based on the maid's memory. This also means that if an item is not in the maid's memory, or if some items in the memory do not exist, the craft may fail. If the Maid's backpack does not have enough capacity to store all the crafting intermediates, the Maid will attempt to split the crafting into multiple runs.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.craft_guide.pages.0.4.text":"Example: Crafting an iron pickaxe with logs and coarse iron in the storages. Craft guide: $(li) Crafting table: craft planks$(li) Craft table: craft sticks $(li) Furnace: Input 1 - upper side of furnace, input a coarse Iron; Input 2 - left side of furnace, input a Log; Output lower side of furnace, output an Iron Ingot $(br2) Using the above craft guide the maid will be able to automate Iron Pickaxe Crafting.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.filter":"Filter",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.filter.pages.0.1.text":"Maids will by default store items close to each other without sorting them. You can sort your storages by sticking an item display box on the storage grid and putting a [Filter] into it. Right click on the filter in hand to open the GUI, mark the items in the grid and select black/white list mode, the maid will sort the items according to this filter. $(br2) If a filter is set with the container already having contents, the maid will remove items that don't fit the filter to other containers the next time she visits here.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.filter.pages.0.2.text":"If you simply don't want the maid to deposit anything into a container, you can disable access to it with the [No Access]",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.inventory_list":"Inventory List",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.inventory_list.pages.0.1.text":"If you want to know what items are in your storages, you can craft a [Storage List] and give it to the Maid. The maid will write her memory into that storage list and throw it out. $(br2) Right-click to open the storage list, and you can see how many items there are and where they are stored. You can click on an item to show its location in the world.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.request_list":"Request List",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.request_list.pages.0.1.text":"If you need a maid to find certain items, you can craft a [Request List]. Right click to open the GUI, fill in the items you want on the left side of the list, use the mouse wheel to adjust the quantity, and hold down sneak to quickly adjust the quantity. After closing the GUI, you can sneak right-click on a storage to specify that the maid will put the found item somewhere, and sneak right-click on an already-marked location to select the input side.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.request_list.pages.0.2.text":"Once filled in, hand it to the maid. The maid will look for this item from the storage it manages and deliver it to the specified location. If no target location is specified, the maid will leave the item on her person for 30 seconds, after which she will re-store the item and the list back in the storages. The maid will attempt to interact with the square $(br2) above the target storage as she delivers the item back (you can place a note box to have the maid remind herself of the task completion). $(br2) If you set a repeat time, the maid will put the list away in her backpack when it's done and perform this task again after a certain amount of time.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_define":"Storage Definitions",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_define.pages.0.1.text":"Storage Definitions are used to change the storage that the Maid can access, this item adjusts the Maid so that she no longer accesses/additional access/only accesses/only accesses a certain storage from a certain facet. Handheld storage definitions right click to mark a face of storage, or sneak right click to mark a storage square. The $(br2) sneak right-click toggles the marking mode; in short, you can use the Replace mode to mark storage as whitelisted storage, and the Remove mode to mark storage as blacklisted storage, with other, relatively uncommon uses described below if needed.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_define.pages.0.2.text":"Initially, the target storage that the maid wants to access should be all nearby chest-type storage (including barrels and commonly other modules' chests). However, in some cases we may want the maid to have access to specific containers, and you can use storage definitions to adjust the list of storage that the maid wants to access. The four modes of storage definitions are essentially modifications to the maid's intended storage list. $(li) add adds the marked location to the list $(li) remove removes the marked location from the list $(li) replace removes all locations from the list first, then adds the marked location $(li) replace specify removes the same storage as the marked location's location from the list, then adds the marked location $(br2) If the maid holds multiple storage definitions, the maid will perform the above operations in order of the storage definitions (the storage definition on the request list takes effect last).",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_manager":"Storage Manage",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_manager.pages.0.1.text":"Welcome to the Maid Warehouse Manager. The Warehouse Manager provides the Maid with the ability to manage a large amount of storage as well as interact with various types of containers. Based on this, the Maid can help you find various sundries, automatically store items and even craft and carry items automatically. Select the work [Storages Manage] for the Maid and start using the Maid to manage items. The $(br2) Maid Warehouse Manager is a partial modification of the original Maid interaction mechanism, and most of the ‘hand over to maid’ interactions in the following section can be done by right-clicking on the Maid while holding the item in your hand.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_manager.pages.0.2.text":"When a maid is working, the maid will be able to manage containers, which by default only include chests. By placing chests in the Maid's work area, the Maid will periodically scan the area for all chests and memorise their contents. These memories will help the maid find/store items. $(br2) When the maid has completed a scan of all chests, she will eliminate from her memory all storage that is no longer reachable, including those that cannot be walked to in their vicinity and those that have disappeared themselves.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.storage_manager.pages.0.3.text":"If the maid picks up a dropped item on the floor, the maid will attempt to place it in a nearby storage. The maid will prioritise storage according to the filter (see later), then items already in the chest, and finally will choose the nearest empty chest for storage. $(br2) Maids picking up dropped items will not pick up the [request list] on the floor. By default, maids may visit many chests to ensure better sorting. If you want the maid to do storage as soon as possible, you can turn off sorting in the job settings.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.work_setting":"Work Settings",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.work_setting.pages.0.1.text":"No Sorting Mode allows the maid to store items without sorting them anymore $(br2) Memory Mode is used to specify how the maid uses memory. For storages where items change frequently and item locations may change frequently, use [Memory First] mode, then the maid will continue to look for other storage when the memory fails; for storages where items change less frequently, use [Memory Only] mode, the maid will use the memory directly to look for the item, and if it fails, the item will be assumed to be non-existent. In [Always Scan] mode, the maid will not use memory to locate the item.",
  "patchouli.touhou_little_maid.book.entries.maid_storage_manager.work_setting.pages.0.2.text":"Co-working mode allows the maid to behave as if she is working with the player, as follows $(li) The maid moves with the player in the workspace, unless given a task $(li) The maid accesses storage along with the player and updates her memory instantly (i.e., items placed in chests are immediately known to the maid)","task.maid_storage_manager.storage_manage": "Storage Manager",
  "task.maid_storage_manager.storage_manage.desc": "Helping finding things in many chests and store item into them",
  "tooltip.maid_storage_manager.change_flag.desc": "Mark the storages to be changed by player or others and let maid check it again.",
  "tooltip.maid_storage_manager.change_flag.storages": "%s Storage Marked",
  "tooltip.maid_storage_manager.craft_guide.input1": "Input1",
  "tooltip.maid_storage_manager.craft_guide.input2": "Input2",
  "tooltip.maid_storage_manager.craft_guide.item": "*[%s]×%s",
  "tooltip.maid_storage_manager.craft_guide.output": "Output",
  "tooltip.maid_storage_manager.craft_guide.storage": "Bind to [%s,%s,%s]",
  "tooltip.maid_storage_manager.filter_list.black_mode": "Blacklist",
  "tooltip.maid_storage_manager.filter_list.desc": "Put this item in an item frame outside the target chest",
  "tooltip.maid_storage_manager.filter_list.no_tag": "Empty Filter List",
  "tooltip.maid_storage_manager.filter_list.white_mode": "Whitelist",
  "tooltip.maid_storage_manager.inventory_list.desc": "Give the item to your maid and wait her for a written one.",
  "tooltip.maid_storage_manager.portable_craft_calculator.desc": "Small enough to carry with you",
  "tooltip.maid_storage_manager.portable_craft_calculator.progress": "> %s completed",
  "tooltip.maid_storage_manager.portable_craft_calculator.stored_layers": "%s operation generated",
  "tooltip.maid_storage_manager.portable_craft_calculator.stored_recipe": "%s craft guides stored.",
  "tooltip.maid_storage_manager.request_list.author": "Author: %s",
  "tooltip.maid_storage_manager.request_list.collected": "Collected %d/%d",
  "tooltip.maid_storage_manager.request_list.cooling_down": "CD [%s]",
  "tooltip.maid_storage_manager.request_list.desc": "Config and give the item to your maid.",
  "tooltip.maid_storage_manager.request_list.done_fail": "Fail to collect",
  "tooltip.maid_storage_manager.request_list.done_success": "Done Successfully",
  "tooltip.maid_storage_manager.request_list.jei.too_many_to_transfer": "Too many Items to transfer",
  "tooltip.maid_storage_manager.request_list.missing_items": "Missing",
  "tooltip.maid_storage_manager.request_list.missing_items_item": "- [%s * %s]",
  "tooltip.maid_storage_manager.request_list.no_storage": "Shift&click an chest to set storage",
  "tooltip.maid_storage_manager.request_list.no_tag": "Empty Request List",
  "tooltip.maid_storage_manager.request_list.open_gui_to_config": "Open GUI to config",
  "tooltip.maid_storage_manager.request_list.processing": "Processing",
  "tooltip.maid_storage_manager.request_list.repeat_interval": "Repeat pre %s ticks",
  "tooltip.maid_storage_manager.request_list.storage": "Storage Bind[%s %s %s]",
  "tooltip.maid_storage_manager.request_list.time": "Create at day %s",
  "tooltip.maid_storage_manager.request_list.time.str": "%s (%s:%s)",
  "tooltip.maid_storage_manager.storage_define_bauble.count": "%s Storage Set",
  "tooltip.maid_storage_manager.written_request_list.desc": "A notebook that recorded the item your maid has view.",
  "advancements.maid_storage_manager.request_list.title": "帮帮我，女仆小姐！",
  "advancements.maid_storage_manager.request_list.desc": "交给女仆一份请求列表来让女仆帮忙寻找物品。",
  "advancements.maid_storage_manager.storage_list.title": "让我看看",
  "advancements.maid_storage_manager.storage_list.desc": "交给女仆存储列表来查看女仆记忆中的存储内容。",
  "advancements.maid_storage_manager.view.title": "这里有个箱子",
  "advancements.maid_storage_manager.view.desc": "女仆查看了一个箱子的内容",
  "advancements.maid_storage_manager.storage_define.title": "存储，如下规定",
  "advancements.maid_storage_manager.storage_define.desc": "合成一个存储定义",
  "advancements.maid_storage_manager.portable_craft_calculator_bauble.title": "便于携带的外置大脑",
  "advancements.maid_storage_manager.portable_craft_calculator_bauble.desc": "合成一个便携式合成计算器。",
  "advancements.maid_storage_manager.request_list_repeat.title": "搬运工",
  "advancements.maid_storage_manager.request_list_repeat.desc": "设置请求重复时间来让女仆重复执行请求。",
  "advancements.maid_storage_manager.craft_guide.title": "学习、制造",
  "advancements.maid_storage_manager.craft_guide.desc": "合成一个合成指导。",
  "advancements.maid_storage_manager.change_flag.title": "通知",
  "advancements.maid_storage_manager.change_flag.desc": "使用存储变更旗通知女仆存储变更",
  "advancements.maid_storage_manager.resort.title": "全乱啦！",
  "advancements.maid_storage_manager.resort.desc": "女仆进行了一次存储整理",
  "advancements.maid_storage_manager.cowork.title": "肩并肩",
  "advancements.maid_storage_manager.cowork.desc": "开启协同工作模式",
  "advancements.maid_storage_manager.storage_manager.title": "箱子海里的管理员",
  "advancements.maid_storage_manager.storage_manager.desc": "女仆现在是仓库管理员！"
}